<?php

use Illuminate\Database\Seeder;

use Illuminate\Support\Facades\DB;
use App\Model\DiagnosisTitle;
use App\Model\DiagnosisQuestion;
use App\Model\DiagnosisQuestionAnswer;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        // $this->call(UsersTableSeeder::class);
        $this->makeDiagnosis();
    }

    private $diagnosises = [
        [
            "title"=>"対人関係向上",
            "contents"=>"「ソーシャルスタイル理論」に基づく、コニュニケーションスタイルの傾向を測る診断です",
            "logic"=>"social-style-logic.0",
            "questions"=>[
                ["他者から、「声が大きいね」と言われることがある","",["はい","","1","","1"],["いいえ","","","",""]],
                ["他者から、「はっきりと意見をいわないよね」と言われることがある","",["はい","1","","1",""],["いいえ","","","",""]],
                ["他者から、何を考えているかよくわからないと言われることがある","",["はい","1","1","",""],["いいえ","","","",""]],
                ["自分は、意見が異なる相手に対して否定的になってしまうタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、会話の中で感情が声にあまり出ないと思う","",["はい","1","1","",""],["いいえ","","","",""]],
                
                ["自分は、結論より、そこに至る理由をしっかり説明するタイプだと思う","",["はい","1","","",""],["いいえ","","","",""]],
                ["自分は、言いにくいことをはっきりと伝えるタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、相手に合わせて意見を変えるタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、声が小さく会話が苦手なタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["他者から、感情的だと言われることがある","",["はい","","","1","1"],["いいえ","","","",""]],
                
                ["自分は、意見が異なる相手の納得を目指すタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、相手の発言を素直に信じるタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、まず結論を説明して、必要なら理由を説明するタイプだと思う","",["はい","","1","",""],["いいえ","","","",""]],
                ["自分は、会話の中で「聞く」より「話す」割合が高いと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、意見が異なる相手に意見を押し付けるタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                
                ["他者から、「よくしゃべるね」と言われることがある","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、会話の中で感情が表情によく出ると思う","",["はい","","","1","1"],["いいえ","","","",""]],
                ["自分は、友人関係は「質」より「量」だと思う","",["はい","","","","1"],["いいえ","","","",""]],
                ["自分は、会話の中で感情的になることが少ないと思う","",["はい","1","1","",""],["いいえ","","","",""]],
                ["自分は、大きな声ではっきりと会話するタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                
                ["自分は、理屈よりも自分の感情を重視した会話をするタイプだと思う","",["はい","","","1","1"],["いいえ","","","",""]],
                ["自分は、友人関係は「量」より「質」だと思う","",["はい","","","1",""],["いいえ","","","",""]],
                ["他者から、声に抑揚が無いと言われることがある","",["はい","1","1","",""],["いいえ","","","",""]],
                ["他者から、「無表情だよね」と言われることがある","",["はい","1","1","",""],["いいえ","","","",""]],
                ["自分は、会話の中で感情的になることが多いと思う","",["はい","","","1","1"],["いいえ","","","",""]],
                
                ["自分は、集団の中でリーダー役になることが多いと思う","",["はい","","","","1"],["いいえ","","","",""]],
                ["他者から、「聞き上手だね」といわれることがある","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、相手の気持ちを考えて質問できるタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["他者から、「言いにくいことでもはっきり言うね」と言われることがある","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、会話の中で感情が声によく出ると思う","",["はい","","","1","1"],["いいえ","","","",""]],
                
                ["自分は、自分の感情よりも事実や理論を重視した会話をするタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、理屈も大切だが、必ず気持ちを伝えるタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、集団の中でサポート役になることが多いと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、誰に対しても意見を変えないタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、行動の前にしっかりとリスクを考える性格だと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                
                ["自分は、意見が異なる相手に対しても有効的に対処できるタイプだと思う","",["はい","","","",""],["いいえ","","","",""]],
                ["自分は、自分が聞きたいことばかり聞いてしまうタイプだと思う","",["はい","","","",""],["いいえ","","","",""]],
                ["自分は、意見が異なる相手に合わせてしまうタイプだと思う","",["はい","","","",""],["いいえ","","","",""]],
                ["自分は、相手の発言を疑ってかかるタイプだと思う","",["はい","","","",""],["いいえ","","","",""]],
                ["自分は、相手が伝えたいことを引き出せるタイプだと思う","",["はい","","","",""],["いいえ","","","",""]],
                
                ["他者から、「声が小さいね」と言われることがある","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、相手の気持ちより効率を重視して質問するタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、リスクを恐れず理想を追いかける性格だと思う","",["はい","1","","",""],["いいえ","","","",""]],
                ["自分は、意見表明の時に、感情を交えないタイプだと思う","",["はい","1","1","",""],["いいえ","","","",""]],
                ["自分は、周囲の意見を聞く前に、最初に意見を言う性格だと思う","",["はい","","1","","1"],["いいえ","","","",""]],

                ["自分は、会話の中で「話す」より「聞く」割合が高いと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、言いにくいことは伝えるかを慎重に判断するタイプだと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["自分は、意見が異なる相手を説得する傾向が強いタイプだと思う","",["はい","","1","","1"],["いいえ","","","",""]],
                ["自分は、周囲の意見が出揃うまで意見を言わない性格だと思う","",["はい","1","","1",""],["いいえ","","","",""]],
                ["他者から、会話の中で感情が声に出ると言われることがある","",["はい","","","1","1"],["いいえ","","","",""]],
            ]
        ]
    ];
    private $diagnosises_x = [
        [
            "title"=>"「自分は周りからどう見られているか？」",
            "contents"=>"18個の質問に答えて傾向をしりましょう！",
            "logic"=>"social-style-logic.1",
            "questions"=>[
                ["話すペースが","",["早い","A","1"],["ゆっくり","B","1"]],
                ["話すとき間を","",["とらない","A","1"],["とる","B","1"]],
                ["話すとき語尾が","",["きっぱり","A","1"],["ソフト","B","1"]],
                ["話すとき声が","",["大きい","A","1"],["小さい","B","1"]],
                ["話すとき","",["自分から話す","A","1"],["後から発言する","B","1"]],
                ["話すとき","",["結論から話す","A","1"],["順を追って話す","B","1"]],
                ["話すとき","",["まず自分の意見を言う","A","1"],["まずまわりの意見を聞く","B","1"]],
                ["話すとき","",["視線をしっかり合わせる","A","1"],["視線をソフトに合わせる","B","1"]],
                ["話すとき","",["質問へは即決","A","1"],["質問へは熟考","B","1"]],
                //
                ["表情が","",["豊か","C","1"],["ポーカーフェイス","D","1"]],
                ["声に","",["抑揚がある","C","1"],["抑揚がない","D","1"]],
                ["身振り手振りを","",["交えて話す","C","1"],["あまり使わない","D","1"]],
                ["雰囲気は","",["カジュアルである","C","1"],["ビジネスライクである","D","1"]],
                ["使う言葉は","",["平易なものが多い","C","1"],["硬いものが多い","D","1"]],
                ["得意なのは","",["たとえ話やエピソード","C","1"],["情報・データ・数字","D","1"]],
                ["はじめは","",["まず人間関係を築く","C","1"],["すぐに仕事に取り掛かる","D","1"]],
                ["仕事のしかたは","",["周りと一緒に進めていく","C","1"],["一人で黙々と進める","D","1"]],
                ["気持ちが","",["顔に出やすい","C","1"],["顔には出ない","D","1"]],
            ],
        ],
        [
            "title"=>"「自分のタイプがわかるチェックリスト」",
            "contents"=>"45項目に答えて傾向をしりましょう！",
            "logic"=>"social-style-logic.2",
            "questions"=>[
                ["行動的、野心的、エネルギッシュである","",["はい","A","1"],["いいえ","A","0"]],
                ["向上心があるほうだ","",["はい","A","1"],["いいえ","A","0"]],
                ["決断力があるほうだ","",["はい","A","1"],["いいえ","A","0"]],
                ["人間関係より仕事を優先した","",["はい","A","1"],["いいえ","A","0"]],
                ["正義感が強いほうだ","",["はい","A","1"],["いいえ","A","0"]],
                ["ペースが早いと言われる","",["はい","A","1"],["いいえ","A","0"]],
                ["保身的な態度を取るのは嫌いだ","",["はい","A","1"],["いいえ","A","0"]],
                ["場を仕切ったり、リーダーシップを取ることを好む","",["はい","A","1"],["いいえ","A","0"]],
                ["自分をコントロールしようとする人には反発してしまう","",["はい","A","1"],["いいえ","A","0"]],
                ["人に怖い、キツいと言われたことがある","",["はい","A","1"],["いいえ","A","0"]],
                ["自分の弱いところはみせたくない","",["はい","A","1"],["いいえ","A","0"]],
                ["人をなかなか信用しない","",["はい","A","1"],["いいえ","A","0"]],
                ["人の気持ちには鈍感なほうだと思う","",["はい","A","1"],["いいえ","A","0"]],
                ["優しい感情を表すことは苦手だ","",["はい","A","1"],["いいえ","A","0"]],
                ["褒められると何か裏があるのでは？と思うことがある","",["はい","A","1"],["いいえ","A","0"]],
                //
                ["人と活気のあることをするのが好きだ","",["はい","B","1"],["いいえ","B","0"]],
                ["細かいことはあまり気にとめない","",["はい","B","1"],["いいえ","B","0"]],
                ["計画を立てたり、計画通りに動くのは苦手だ","",["はい","B","1"],["いいえ","B","0"]],
                ["あきっぽいとよく言われる","",["はい","B","1"],["いいえ","B","0"]],
                ["新しい仕事を始めるのは得意だ","",["はい","B","1"],["いいえ","B","0"]],
                ["事務処理など、ルーティンワークは苦手だ","",["はい","B","1"],["いいえ","B","0"]],
                ["場を仕切るのが好き、もしくは得意だ","",["はい","B","1"],["いいえ","B","0"]],
                ["調子がいいヤツだと言われることがある","",["はい","B","1"],["いいえ","B","0"]],
                ["話題を提供することが得意だ","",["はい","B","1"],["いいえ","B","0"]],
                ["過去の規則や慣習にとらわれるのはおかしい","",["はい","B","1"],["いいえ","B","0"]],
                ["人をほめるのが得意で、ほめられるのも好き","",["はい","B","1"],["いいえ","B","0"]],
                ["意見を求められるとうれしい","",["はい","B","1"],["いいえ","B","0"]],
                ["はじめての人とでも気軽にコニュニケーションを交わせる","",["はい","B","1"],["いいえ","B","0"]],
                ["感情表現は豊かなほうだと思う","",["はい","B","1"],["いいえ","B","0"]],
                ["[一緒にいてよく楽しいと言われる","",["はい","B","1"],["いいえ","B","0"]],
                //
                ["人をサポートする仕事が好きだ","",["はい","C","1"],["いいえ","C","0"]],
                ["決断するときは、じっくり考えたい","",["はい","C","1"],["いいえ","C","0"]],
                ["人の心や空気を読みのが得意だ","",["はい","C","1"],["いいえ","C","0"]],
                ["困っている人や悩んでいる人の相談を受けることが多い","",["はい","C","1"],["いいえ","C","0"]],
                ["リスクを冒すのは苦手","",["はい","C","1"],["いいえ","C","0"]],
                ["ビジネスよりも人を優先したい","",["はい","C","1"],["いいえ","C","0"]],
                ["話しやすいとよく言われる","",["はい","C","1"],["いいえ","C","0"]],
                ["相手の反応が気になる","",["はい","C","1"],["いいえ","C","0"]],
                ["気配りができるほうだと思う","",["はい","C","1"],["いいえ","C","0"]],
                ["できるだけ人と対立したくない","",["はい","C","1"],["いいえ","C","0"]],
                ["頼まれるとノーと言えない","",["はい","C","1"],["いいえ","C","0"]],
                ["感謝や労いの言葉をかけられると、やる気が湧いてくる","",["はい","C","1"],["いいえ","C","0"]],
                ["上を目指すよりも、現場でみんなを支えたい","",["はい","C","1"],["いいえ","C","0"]],
                ["優しい、穏やかだと言われる","",["はい","C","1"],["いいえ","C","0"]],
                ["単独仕事より、チーム仕事の方が好きだ","",["はい","C","1"],["いいえ","C","0"]],
                //
                ["データや資料を集め、分析するのは苦にならない","",["はい","D","1"],["いいえ","D","0"]],
                ["計画通りに実行するのが好きだ","",["はい","D","1"],["いいえ","D","0"]],
                ["客観的、冷静だとよく言われる","",["はい","D","1"],["いいえ","D","0"]],
                ["失敗や間違いは、できるだけしたくない","",["はい","D","1"],["いいえ","D","0"]],
                ["ルーティンワークは苦にならない","",["はい","D","1"],["いいえ","D","0"]],
                ["人から頑固、まじめと言われることがある","",["はい","D","1"],["いいえ","D","0"]],
                ["孤立してもあまり苦にならない","",["はい","D","1"],["いいえ","D","0"]],
                ["自分から主張することは少ない","",["はい","D","1"],["いいえ","D","0"]],
                ["話が長いと言われる","",["はい","D","1"],["いいえ","D","0"]],
                ["自分のことを話すのは苦手だ","",["はい","D","1"],["いいえ","D","0"]],
                ["急に意見を求められても困る","",["はい","D","1"],["いいえ","D","0"]],
                ["まずはリスクから考える傾向がある","",["はい","D","1"],["いいえ","D","0"]],
                ["ひとつのことを継続して、とことんやるのが好きだ","",["はい","D","1"],["いいえ","D","0"]],
                ["石橋をたたいて渡るほうだ","",["はい","D","1"],["いいえ","D","0"]],
                ["感情表現はあまり豊かではない","",["はい","D","1"],["いいえ","D","0"]],
            ]
        ],
    ];

    private function makeDiagnosis()
    {
        DB::table('diagnosis_titles')->truncate();
        DB::table('diagnosis_questions')->truncate();
        DB::table('diagnosis_question_answers')->truncate();
        //
        foreach ($this->diagnosises as $i=>$diag) {
            $title = new DiagnosisTitle();
            $title->title = $diag["title"];
            $title->contents = $diag["contents"];
            $title->logic = $diag["logic"];
            $title->save();

            $this->makeDiagnosisQuestion($i, $title->id);
        }
    }

    private function makeDIagnosisQuestion($i, $diagnosis_id)
    {
        $ques = $this->diagnosises[$i]["questions"];
        foreach ($ques as $no => $question) {
            $q = new DiagnosisQuestion();

            $q->diagnosis_table_id = $diagnosis_id;
            $q->no = $no+1;
            $q->title = $question["0"];
            $q->contents = $question["1"];
            $q->save();

            $this->makeDiagnosisQuestionAnswer($q->id, [$question["2"], $question["3"]]);
        }
    }

    private function makeDiagnosisQuestionAnswer($id, $answers)
    {
        foreach ($answers as $no=>$answer) {
            $ans =  new DiagnosisQuestionAnswer();
            $ans->diagnosis_question_id = $id;
            $ans->no = $no+1;
            $ans->answer = $answer[0];
            $ans->blockA_value = intval($answer[1]);
            $ans->blockB_value = intval($answer[2]);
            $ans->blockC_value = intval($answer[3]);
            $ans->blockD_value = intval($answer[4]);
            
            $ans->save();
        }
    }
}
